{"Advance Ethnographic Research Methods.xlsx": {"course_desc": "This course introduces diverse ethnographic methods  and epistemologies in anthropology: participant observation, visual sources, archival documents, oral narratives, visual as well as digital resources. It exposes students to data gathering techniques, designing a research proposal, conducting structured and unstructured interviews, while at the same time introducing key debates on the conditions of producing knowledge. The course will encourage students to think reflexively while designing their research proposals, by asking ways social position of the researcher is connected to data production. Through this, questions of objectivity, interpretation, social construction in the production of ethnographic knowledge will be explored, by bringing questions of power and the politics of representation in the production of social ‘facts’.  At the end of the course, students will be able to be able to design research projects and write grant applications, while being reflexive of the location through which research is produced. ", "lecture topic": ["Course overview: the production of anthropological knowledge", "Fieldwork, participant observation and ethnography", "Interviewing and semi-structured interviews", "Sampling Design, Survey methods and questionnaire", "Historical sources: documentary and Oral Narratives", "Visual Methods: Photography and Films in the production of anthropological knowledge", "Ethnography of virtual communities", "Netography: Doing Ethnographic Research Online", "Ethnography of Entanglements:  Studying relations between people, environments, artefacts and algorithms ", "Ethics in qualitative research and ethnographic representation", "Ethnography as writing: fieldnotes and writing up", "Reading Ethnographies ", "Writing Grant/Research Proposal "], "assessment plan": "A31"}, "Advanced Machine Learning.xlsx": {"course_desc": "This is an advanced course on Pattern Recognition and Machine Learning. It is intended for senior undergraduate and graduate students who already have background in PR or ML. The course is designed as a set of special topics that will be covered through research papers and books. The course will focus on algorithms and models along with providing a good perspective of different real world applications.", "lecture topic": ["Introduction to Machine Learning and Pattern Classification", "Learning Data Representations: Deep Learning", "Learning Data Representations: Dictionary learning", "Distance Metric Learning", "Domain Adaptation"], "assessment plan": "A28"}, "Advanced Operating Systems.xlsx": {"course_desc": "The objective of this course is to study existing approaches for building an OS kernel. We aim to discuss monolithic kernels, lightweight kernels, embedded OS, distributed OS, etc. We will discuss the pros and cons of each of these design decisions. We will see how modern languages play a crucial role in designing the end to end software stack. Students are expected to read research papers before the class discussions.", "lecture topic": ["Intorduction to Unix systems", "Introduction to X86 assembly", "Exokernel ", "Microkernel", "Security in computer systems", "Information flow control", "HiStar OS", "Managed Languages", "Singularity OS", "Introduction to Rust", "Embedded OS", "Distributed systems", "Barrelfish OS"], "assessment plan": "A35"}, "Advanced Programming.xlsx": {"course_desc": "The Advanced Programming is a successor to the Introduction of Programming course. The main goal of this course is to prepare students to the challenge of building large-scale programs which multiple functional components, some of which could be designed/implemented independently. The course will use Java to to introduce students to concepts of object orientation, reusable code design, test-driven development, programming to an application-programming-interface, pattern oriented program design and implementation etc. At the end of the course the students are expected to be able to work in teams in order to develop large application programs starting from a reasonably well-defined application design with multiple independent components with well-defined interfaces. \n\nNOTE: The course is not meant to teach the features of Java programming language", "lecture topic": ["• Introduction to Object Oriented Paradigm\n• Encapsulation\n• Identifying classes and objects\n• Working with objects", "• Class relationships\n* Interfaces", "• Polymorphism\n• Inheritance", "• Abstract class and methods\n• Object class\n• Comprable and Comparator interfaces", "* Generic programming\n* Collection framework", "• Introduction to defensive programming\n• Exception handling\n• Assertions\n* Debugging programs", "* Unit testing\n* Junit\n* Source code control", "* UML diagrams\n* Introduction to even driven programming using JavaFX", "* Introduction to processes and threads\n* Multithreaded programming", "* Thread pool\n* Mutual exclusion\n• Locks", "* Design patterns", "* Some more design patterns", "Spill Over"], "assessment plan": "A34"}, "Advanced Topics in Mobile Computing.xlsx": {"course_desc": "Mobile Computing research is progressing at a fast pace. With close to 3.5 billion phone users, mobile phones have become the ubiquitous computing platform. In last decade, the research has progressed in the areas of  cyber foraging, cloud computing, sensing and activity inference, opportunistic communications, etc. to create the next-generation mobile computing systems. An example is the prevalence and popularity of location-aware services where sensing, cloud computing, and mobile platforms are combined to provide a personalized, context-aware service. \nIn this course, we will be studying, through  research papers (approximately 20+ papers from Mobisys, IEEE Transactions on Mobile Computing, SigComm, UbiComp, CHI, CSCW)  latest advances in the mobile computing research, including but not limited to sensing, activity recognition, augmented and virtual reality,  applications in the areas of health, education, etc.  The course will be of the research nature and will involve advanced programming projects as part of the requirement. It will be assumed that the student has full understanding of Operating System, Computer networks, and has advanced programming skills with mobile and web-based platforms.  ", "lecture topic": ["Introduction to Mobile Computing and Course Overview", "On-device Mobile Computing Systems: sensing systems for Activity recognition: smartphones, watches, augemented/virtual reality", "Cloud-based Mobile Computing Systems: mobile-cloud communication, middleware, data management, etc.  ", "Applications of Mobile based systems in different domains, e.g., health, education, low-resource settings, etc.  "], "assessment plan": "A22"}, "Artificial Intelligence.xlsx": {"course_desc": "This is an introductory course in Artificial Intelligence. This course introduces the students to various search techniques, knowledge representation, reasoning, and learning.", "lecture topic": ["Introduction to AI\n", "Knowledge representation using Predicate Logic", "Blind search and search based on heuristics", "Search using constraint satisfaction", "Adversarial Search (Game playing)", "Knowledge representation using Frames and Conceptual Dependency", "Nature inspired search algorithms", "Probabilistic Reasoning: Bayesian Network, Dempser Shafer, Fuzzy Logic", "Learning: Linear Regression, Perceptron, Neural Networks", "Planning and Reinforcement Learning", "Knowledge representation: Natural Language Processing, Applications"], "assessment plan": "A35"}, "Bayesian Machine Learning.xlsx": {"course_desc": "In this course, we will discuss the foundations of Bayesian statistical modeling in the context of machine learning through various case-studies/running-examples. Some of the key benefits of the Bayesian approach include the ability to quantify the uncertainty in the parameters/predictions through posterior probability distributions, the ability to incorporate prior knowledge in a principled way, the ability to learn the model hyperparameters and the right model size/complexity automatically from data. This course will provide a platform to set up a machine learning problem as a Bayesian model and design exact or approximate (sampling/optimization) solution methods for computationally scalable inference. This course provides foundations to modern methods of Bayesian modelling.", "lecture topic": ["Review of Random processes and Statistical Signal Processing", "Introduction to Bayesian Machine Learning, Bayesian Linear Regression: Beta-bernoulli Model and Inference with Gaussian distribution.", "Bayesian Generative and Discriminative Classification, and Bayesian naïve Bayes, Bay", " Probabilistic Inference and Exponential Family", "Bayesian Inference with (Point) Estimation of Hyperparameters, Conjugacy and conjugate distributions. Generalized linear model", "Approximate Bayesian Inference: Sampling methods, Variational Inference, SVB, other methods.", "Bayesian Non-parametrics", "Bayesian Deep Learning: Deep Gaussian Processes, Variational auto-encoders", "Sparsity and Bayesian Learning - Deep and non-deep", "Bayesian State-Space Models and Kalman Filtering"], "assessment plan": "A27"}, "Behavioural Economics.xlsx": {"course_desc": "The course will provide a theoretical understanding of behavioural economics, and then apply these theories to do experimental analysis in a laboratory setting. Behavioural economics incorporates human traits of cognition, social preferences, and emotional responses to better understand choices made in a setting that may not seem \"rational\" in the traditional sense of the word. Understanding of choices influenced by behaviour is useful in a variety of arenas, including policy making, IO, and finance. Behavioural economics literature also has inter-disciplinary relevance with psychology and cognitive sciences. ", "lecture topic": ["Decision Making in Economics under Certainty", "Uncertainty, Risk and Prospect Theory", "Bounded Rationality", "Intertemporal Choice (Procrastination, Hyperbolic Discounting, and Present Bias)", "Human Sociality (Altruism, Inequity Aversion, Conformity, Reciprocity, Fairness, Vengeance)", "Strategic Interaction", "Behavioural Experiments and zTree", "Nudges", "Brief Introduction to Behavioural Finance and Neuroeconomics"], "assessment plan": "A31"}, "Biophysics.xlsx": {"course_desc": "This biophysics course shall delve into concepts of physics acting upon biomolecules, primarily proteins. From understanding protein folding to predicting 3-dimension structures from the 1-dimension sequence, the course shall involve assignments that shall give the students the neccessary knowledge to deal with structural problems.", "lecture topic": ["Course Introduction & Biological Interactions", "Introduction to Statistical Mechanics and basic mathematics in biophysics", "Electrostatics and other interactions in proteins & water, Secondary structure and amino acid properties", "Free energy and the hydrophobic effect", "Kinetics of Protein Folding", "Thermodynamics of structural transitions, folding & denaturation", "Insertion, Folding &\nInteractions of\nMembrane Proteins", "Structure prediction and CASP", "Secondary structure stability, helix-coil transitions & cooperativity", "Statistical mechanics, the partition function, and first- order phase transitions"], "assessment plan": "A26"}, "Categorical Data Analysis.xlsx": {"course_desc": "The study of categorical data sets involve commonly used distributions like Bernoulli, Binomial and Poisson. This course involves analyzing such data sets. The commonly used methods like odds ratio and relative risk will be discussed. The multiple regression model building for categorical data will be discussed in detail. The emphasis will be on studying these models on real life data sets and building and interpretating the results.", "lecture topic": ["Introduction to Categorical Response Data; Probability Distributions like Binomial, Multinomial, Poisson, Negative Binomial; Small and Large Sample inference", "Two, Three and k- way Contingency Tables", "Generalized Linear Models for Binary, Count and Rate data. Probit and Negative Binomial regression.\nIteratively reweighted least squares method and Fisher's Information matrix. Inferences using Wald, Score and Likelihood ratio tests", "Multiple Logistic Regression with continuous and categorical predictors and their interactions. Cochran–Mantel–Haenszel tests. Probability based and Standardized interpretaions, Stepwise Variable Selection Algorithms, other criterion like AIC, BIC and AICc. Derivation of deviance, goodness of fit; Pearson and Standardized residuals", "Multicategory Logit Models: Logit Models for Nominal Responses,Cumulative Logit Models for Ordinal Responses, Paired-Category Ordinal Logits", "Loglinear Models; Independence Graphs and Collapsibility; Models for Matched Pairs, Generalized Beta Regression (Time permitting)"], "assessment plan": "A23"}, "Cell Biology and Biochemistry_CSB.xlsx": {"course_desc": "This course consists of two parts; Cell biology and biochemistry. This course is designed to provide an quick overview  on  the biological structures, reactivity, mechanism, thermodynamics, bioenergetics, and kinetics of biological molecules especially the proteins molecules. Further, metabolism of glycolysis will be dealt in detail to illustrate the importance of kinetics, thermodynamics and chemical  mechanisms to understand the metabolic process in wholesome. This core course is both qualtitative and quantitative in nature and requires more of paper and pencil type solving of problems rather than any coding or writing programs.", "lecture topic": [], "assessment plan": "A25"}, "Cognition of Motor Movement.xlsx": {"course_desc": "Motor movement corresponds to various kinds of movement that we execute in everyday life like hand movements (reaching, grasping), eye movements, walking etc. A comprehensive understanding of human motor system would help in engineering better tools, systems, robots, neuroprosthetics etc. This course work is designed to start with the introduction to the human motor system, different types of action or movement like; grasping, reaching, spatial navigation, eye-movement etc.  This will be followed by understanding of the mechanics, neurophysiology and psychology of action planning and execution.", "lecture topic": [], "assessment plan": "A29"}, "Combinatorics and its Applications.xlsx": {"course_desc": "The aim of this course is to familiarize students with fundamental concepts in combinatorics, especially those used in enumeration. Topics covered include permutation groups, linear codes, Stirling and Bell numbers. Generating functions are introduced and their applications are discussed. Applications of group theory to enumeration: Burnside’s Lemma and Polya’s theory of counting are covered. Students are introduced to error correcting codes and linear codes over finite fields.", "lecture topic": ["Introductory Ideas: Solving Linear Recurrences, generating functions, Fibonacci numbers, Stirling numbers of the second kind.", "Formal Power Series, Bell Numbers, Catalan Numbers, Stirling numbers of the first kind.", "Applications of generating functions to unlabeled counting: Integer Partitions, Money changing problem etc.", "Permutation groups, symmetry groups, Burnside’s lemma with applications to enumeration.", "The cycle index and Polya’s theory of counting.", "Error correcting codes, Linear Codes.", "Graph enumeration/Systems of distinct Representatives/de Bruijn sequences (optional)"], "assessment plan": "A30"}, "Complex Analysis.xlsx": {"course_desc": "This course gives students an introduction to the theory of functions of complex variables. A function of a complex variable has some remarkable properties which do not hold true necessarily for a function of a real variable. In this course, we discuss many such properties. We do so by studying complex numbers and their properties; analytic functions and their derivatives, integrals and power series expansions; singularities and zeros of a complex function. The course also covers applications to physics and engineering.   ", "lecture topic": ["Review of Complex variables and Analytic functions", "Elementary functions: exponential, logarithmic, trigonometric and hyperbolic", "Contour Integrals, Branch cuts, Antiderivatives, Cauchy-Goursat theorem, Cauchy Integral formula, Liouville’s theorem, Maximum modulus principle", "Convergence of sequences and series, Taylor’s theorem, Laurent’s theorem,  Absolute and uniform convergence, integration and differentiation of power series.", "Residues, Singularities, Cauchy’s Residue theorem, zeros and poles", "Applications of residues, Jordan’s Lemma, Argument principle, Rouchés theorem", "Conformal Mapping"], "assessment plan": "A34"}, "Computational Gastronomy.xlsx": {"course_desc": "This course is designed to provide an introduction to the emerging science of Computational Gastronomy, a blend of food, data science and computational techniques. Following are the specific objectives that the course aims to fulfil: (a) Introduction to the science of food; (b) Exposition to culinary data; (c) Analysis and visualization of culinary data (statistical analysis, text mining, natural language processing, machine learning); (d) Exposure to challenges and opportunities.", "lecture topic": ["Introduction to the science of food: History of food, Cultural influences, Impact of Technology, Role of data science. Cooking-- the craft and magic: Session by a practicing chef highlighting the need for scientific understanding of food. Role of Computational Gastronomy in achieving data-driven food innovations.", "Culinary Data Analysis [Recipes]: Recipes data structure, Data compilation and curation, Visualization and analysis, The structure of world cuisines, Ingredient popularity and uniqueness.", "Culinary Data Analysis [Flavors]: Flavors data structure, Data compilation and curation, Visualization and analysis, Molecular composition of ingredients, Sensory attributes of taste and odor.", "Culinary Data Analysis [Food Pairing]: Food pairing, Hypothesis testing, Culinary fingerprints, Comparative analysis of world cuisines, Data visualization.", "Culinary Data Analysis [Health-Nutrition]: Nutrional data analysis, Health impacts of food, Food-disease associations, Data analysis and visualization. ", "Modeling and Prediction [Cuisine]: Cuisine classification, Features selection, Implementation of machine learning models, Comparison with the state of the art, Identity of a cuisine,Trasnforming a recipe from one cuisine to another. ", "Modeling and Prediction [Flavor and Fragrance]: Prediction of taste and odor; Features selection, Implementation of machine learning models, Comparison with the state of the art.", "Opportunities and Challenges: Challenges for building the foundations of a data-driven culinary science; Scope for compilation of culinary data from textbooks, scientific literature, traditional knowledge sources, web-based sources (Twitter, Culinary forums, Reviews, Restaurant menus, Food service aggregators, FMCG data repositories, etc.); Opportunities in food-tech industry; Entreprenurship; Policy making; Food security; Public Health, and Sustainable Development.  "], "assessment plan": "A29"}, "Computer Architecture.xlsx": {"course_desc": "This course forms a strong foundation in the understanding and design of modern computing systems. Building on a computer organization base, this course explores techniques that go into designing a modern microprocessor. Fundamental understanding of computer architecture is key not only for students interested in hardware and processor design, but is a foundation for students interested in compilers, operating systems, and high performance programming. This course will explore how the computer architect can utilize the increasing number of transistors available to improve the performance of a processor. Focus will be given to architectures that can exploit different forms of parallelism, whether they be implicit or explicit. This course covers architectural techniques such as multi-issue superscalar processors, out-of-order processors, Very Long Instruction Word (VLIW) processors, advanced caching, and multiprocessor systems.", "lecture topic": ["Introduction: Architecture and Micro-architecture, Machine Models, ISA Characteristics", "Introduction: Architecture and Micro-architecture, Machine Models, ISA Characteristics", "Pipelining: Basics, Structural Hazards, Data Hazards, Control Hazards", "Superscalar: In-Order, Out-of-Order, Bypassing, Interrupts, Exceptions, Speculation, Register Renaming", "Superscalar: In-Order, Out-of-Order, Bypassing, Interrupts, Exceptions, Speculation, Register Renaming", "VLIW: Compiler Optimizations, Challenges, Predication, Case Study", "Branch Prediction: Static and Dynamic Outcome Prediction, Target Address Prediction", "Caches: Motivation, Performance, Optimizations", "Memory Management: Base and Bound Registers, Page based Memory Systems, Translation and Protection, TLB, Cache and Memory Protection Interaction", "Vector Processor and GPU: Vector Parallelism, Vector Hardware Optimizations, Vector Software and Compiler Optimizations, Reduction, Scatter/Gather, SIMD, GPU", "Parallelism: Coarse grain Multithreading, SMT, Synchronization, Sequential Consistency, Cache Coherence Protocols, Message Passing", "Multiprocessor Interconnections: Interconnect Design, Topology, Network Performance, Routing and Flow Control", "Architectures for AI/ ML"], "assessment plan": ""}, "Computer Networks.xlsx": {"course_desc": "This course teaches the standard layers in network, circuit and packet switching, protocols at the link layer, routing algorithms, TCP/IP protocol, and new challenges in wireless networks.\n", "lecture topic": ["Introduction: Networks edge, Network core, Internet structure, OSI Reference Model, What is a Protocol? Circuit switching vs Packet switching, Datagram vs Virtual Circuits, etc.", "Application layer - DNS, Email (SMTP, IMAP, POP), FTP Socket Programming ", "Application layer: Web (HTTP), Proxy, Peer-to-peer file sharing,", "Transport layer: Principles behind transport layer services", "Transport layer: UDP and TCP", "Network layer: Principles behind network layer services, Internet Protocol, ICMP, Introduction to IPv6", "Review of shortest path algorithms, Internet routing, Link State vs. Distance Vector, Intra-AS (RIP, OSPF) vs Inter-AS (BGP)", "Link layer: Ethernet, WiFi, Token Ring, MAC layers, Error detection, ARP, RARP, BOOTP, DHCP", "Physical Layer, Data encoding", "Challenges in Wirelless Networks"], "assessment plan": "A33"}, "Computing For Medicine.xlsx": {"course_desc": "This objective of this course is to train students in creation of computing solutions that are relevant to medicine. The course will pick timely and relevant topics in computing such as the building blocks of electronic health records, modeling and visualizing diseases, pathogen and human factors involved in spread and the ever increasing role of information management and computing in managing diseases.", "lecture topic": ["Computing and Healthcare - The Big Picture (Health Perspective)", "Build the National Health Stack: Interoperability, Data Standards (HL7, DICOM, FHIR)", "Clinical Vocabularies and Ontologies", "Anonymization techniques for sharing data between hospitals", "Anonymization techniques for sharing data between hospitals: Tools Evaluating and Enhancing Data Quality in Medicine and Public Health", "Computing the Host and Pathogen Factors for Disease", "Agent based models (ABM)s, Epidemics / infectious diseases ", "Building ABMs for Epidemics like COVID ", "Randomization and Associative modeling ", "Predictive & Causal Modeling ", "Managing Infodemic by Identifying and Mitigating Fake News", "Managing Infodemic with NLP and Effective Risk Communication Strategies"], "assessment plan": "A34"}, "Consumer Culture and Society_SOC209.xlsx": {"course_desc": "“We live in a consumer society” is a phrase we come across very often. This statement points towards the disproportionate significance of material possessions, consumer goods and services in modern societies and the power of money to “buy it all”. Rising consumption levels is a key aspect of contemporary societies. Right from the food we eat, the clothes we wear, the cars we drive, the media we consume, the technologies we use and the health and educational services we get, consumption pervades our everyday lives and practices. The course on Consumer Culture and Society will draw students into questions like- is shopping only a frivolous activity? Do people claim identities through commodities? What is modern consumption based on- needs or wants? Emphasis in this course will be on understanding consumption practices by embedding them within their social, cultural, and economic contexts. An introduction to classic anthropological studies on consumption and material exchange will provide insights into material culture that has transitioned into corporate cultures of material exchange. Both the positive and negative impacts of consumerism on individuals and societies will be interrogated. Lectures will be complimented through field-based activities where students will examine consumption places and spaces (shopping malls, local markets, advertisements and e-stores) to understand what all (in addition to the actual product) is being sold – an image, a lifestyle, a status symbol, a body type, modernity etc. Using specific consumption domains like food, fashion, media/entertainment technology and intimate relations the course will make the learners engage with the ideas of liberation, choice, identity, status, inequality, lifestyle, freedom, signification, and power. Further, critiques of consumerism and their linkages with big issues of consumer protests and environmental degradation will also be discussed.", "lecture topic": ["Introducing Consumer Culture", "Theoretical Approaches (Mauss, Veblen, and Miller)", "Conspicuous Consumption in Everyday Life", "Lifestyle Practices and Society", "Subjectivity and Reflexivity", "Commodification and Material Culture", "Image Economy: Fashion, Cosmetics and Body", "Media and its effect on the practice of Consumption", "Food Practices and Ecological Concerns", "Responsible Consumption and Ethics (D. Miller)", "Anti-Consumption Strategies: Wave of Minimalistic Lifestyle", "Summing up and Review", "Student Presentations"], "assessment plan": "A28"}, "Contemporary India Sociological Perspective_10th April.xlsx": {"course_desc": "This course will systematically familiarize students with some of the important vignettes of a complex and highly diverse country–India.  Using a historically contextualized approach to understand the shaping of ‘contemporary’, this course will provide an overview of the functioning and transformation of India in the face of global social change. Grounded in sociology but drawing upon recent developments in the other social sciences as well, this course will critically examine the transformations in India’s social, cultural, political, economic and technological realms and will critically interrogate the developmental issues and fault lines facing Indian society both from the vantage point of contemporary and indigenous sociological theory. ", "lecture topic": ["Introducing India: Historical Overview and Population Profile", "Themes and Approaches ", "Social Institutions: Structure and Changes-I", "Social Institutions: Structure and Changes-II", "Forms of Social Stratification and Social Mobility", "Politics of Inclusion/Exclusion", "Indian Economy: Historical Overview and Regional Disparities", "Development Indicators", "Popular Culture and Mass Media- I", "Popular Culture and Mass Media- II", "Technologies and Development-I", "Technologies and Development-II", "Summing up and Review"], "assessment plan": "A37"}, "Data Lifecycle Management.xlsx": {"course_desc": "Typically, in an AI lifecycle, 80% of time is spent in data management and only 20% of time is spend in model learning. The data handling includes data collection, exploration cleaning, labeling, organization and handling updates. In this course, we will go over concepts, algorithms, toolkits and recent research papers to understand data lifecycle. The students will also learn from industry experts on their experience in applying these concepts for building in-production systems. Finally, we will go over how the problem becomes more complex as the data gets hosted on hybrid data platforms.", "lecture topic": ["Background: 1. ML background refresher\n2. What is data lifecycle and why is it important?\n3. Why is this important in the industry  \n4. Data and Features\n5. Trends on where Data Scientist's time is spent\n6. Importance of Data Prep\n7. Case Study\n8. Data For AI\n9. AI for Data\n", "Data Lifecycle\n1.  Overview of different steps\n2. Data Acquisition and associated challenges\n1. Ethical Aspects\n2. PI/SPI identification\n3. Encryption\n4. Metadata \n5. How do data acquisition challenges contribute to upstream uses\n", "Data Exploration and associated challenges\n1. Statistical Inference and exploratory data analysis\n2. Data Variable Types and Identification\n3. Data Exploration using Python\n4. Can all data issues be caught in data exploration?\n", "Data Cleaning/Preparation\n1. Programmatic\n1.1. Missing Values\n1.2. Outliers\n1.3. Data Representations and Challenges\n1.4. Data Labeling and challenges\n1.5. Data Bias - can cleaning lead to bias?\n\n2. Non Programmatic\n2.1. Data transformations\n2.2. Normalization\n", "Data Quality Analysis for ML\n1. Overview of what it means and how it helps a data scientist\n2. Discussion on methods to capture quality issues\n1. Label Noise\n2. Homogeneity\n3. Class Overlap\n4. Advanced class imbalance\n5. Feature Strength\n3. Research Trends\n", "Data Governance\n1. Data Sharing\n2. Access Policy\n3. Regulations like GDPR\n4. Advanced Policy Driven Actions\n", "How it all comes together\n1. Enterprise Case Studies. (May be get an external speaker-Chief Data Officer)\n", "Re looking Data in Hybrid Cloud world\n1. Federated Data\n2. New Challenges in Governance\n3. New Challenges in Discovery\n4. Glimpse of tools in HC - Kubernetes, Istio, OpenSift etc \n", "Project Presentations"], "assessment plan": "A36"}, "Data Mining.xlsx": {"course_desc": "Data mining aims at finding the useful patterns in large data sets. Interest in the field is motivated by the growth of computerized data collection due to ubiquity of Internet enabled devices. This course will cover a set of techniques designed to be used for finding interesting patterns from the data. The techniques include classification, clustering, association rule minin and sequence mining. Students will learn and use the open source R statistical software, see http://www.r-project.org, and machine learning packages such as Weka in this course.", "lecture topic": ["Exploratory data analysis on numeric and categorical attributes, frequent pattern mining (introduction), partitional clustering (K-Means, EM), Classification (Decision Trees) ", "Exploratory data analysis on high dimensional data, PCA, SVD, LDA, Frequent pattern mining (Itemset summaries), sequence pattern mining", "Probabilistic classification, support vector machines, kernel svm, classifier evaluation", "Hierachical/Density based clustering, Spectral clustering, Graph Mining"], "assessment plan": "A29"}, "Decision Theory (Minor Updates).xlsx": {"course_desc": "The theory of rational choice permeates every discipline that touches upon human behavior. This course provides foundations for rational decision making in certain and uncertain environments. Various representation theorems are discussed and the associated decision rules are illustrated in applications. A constant theme in the course are the closely intertwined concepts of utility and probability.   ", "lecture topic": ["Utility and Its Maximization", "Probabilistic Choice ", "Decisions under Risk: Von-Neumann Morgenstern Theorem", "Decisions under Uncertainty: Savage's Theorem", "Allais Paradox, Ellsberg Paradox", "Decisions under Uncertainty: Prospect Theory", "Economic Applications", "Economic Applications", "Decision Theory and Statistics", "Decision Theory and Statistics"], "assessment plan": "A36"}, "Design of Interactive Systems.xlsx": {"course_desc": "The objective of this course is to learn all the aspects of design and development of interactive systems, which are now an important part of our lives. The design and usability of these systems leave an effect on the quality of people’s relationship to technology. Web applications, social media applications, multimedia applications, embedded devices, etc., are all a part of this system, which has become an integral part of our lives. By the end of the course, the students will be familiar with the goals, problems and structure of interactive system design process. Moreover, the students will be exposed to the core techniques for task analysis and user analysis. Furthermore, students will be able to understand the innovative features of interactive system and be able to improve existing interfaces by considering these features.", "lecture topic": ["Essential of Designing Interactive Systems: Introduction", "Essential of Designing Interactive Systems: Usability and Experience Design", "Foundations of Designing Interactive Systems: Memory and Attention", "Foundations of Designing Interactive Systems: Cognitive and Action", "Techniques for Designing Interactive Systems: Evaluation and Task Analysis", "Techniques for Designing Interactive Systems: Visual and Multimodal Interface Design", "Context of Designing Interactive Systems: Web-based Systems and Social Media", "Context of Designing Interactive Systems: Agents, Avatars, and Collaborative Environments", "Project & Research Paper Discussion", "Project & Research Paper Discussion", "Project & Research Paper Discussion", "Project & Research Paper Discussion", "Project & Research Paper Discussion"], "assessment plan": "A35"}, "Design-Processes-and-Perspectives.xlsx": {"course_desc": "This course introduces students to the theoretical and practical aspects of design evolving processes. The course presents the varied palette of design from design of physical objects, to design of human-computer interactions, to design of services, to design of micro systems and connected/complex systems. It offers tasks that initiate the process of learning fundamental skills such as observation & representation, investigation, analyisation, synthesisation, conceptualization, reflections, projection, visualization & representation..\n\nTopics such as Design Processes, Design Perspectives, Design Context & Concerns, Problem Solving Methods, Idea Generation, User-Focused Thinking and Basic Communication are covered during the course. It also introduces students to various stages of problem solving process from problem identification to investigation and analysis of needs as well as tools and techniques used for generation, iteration, evolution and communication of ideas and design concepts.\n\nThis course helps sensitize students to study the social, cultural and physical environment in which his/her design has to operate, so that the design has a meaning or relevance to the people concerned.\n\nBroadly, the course gives students the opportunity to develop essential design thinking skills such as exploring the designed space to identify problem, applying the design thinking process to problems, visualizing design solutions, refining final designs and communicating ideas in visually appropriate form through assignments and projects. ", "lecture topic": ["1. INTRODUCTION TO PROBLEM SOLVING PROCESS\n1a. Factors Influencing Design.\n1b. Brief/Opportunity/Need/'Leap of Faith'\n1c. Research/ Investigation\n1d. Analysis/Synthesis/Findings/Insights\n1e. Problem Statement\n1f. Conceptualisation/Ideation/ Visualization\n1g. Options & Alternatives\n1h. Final Solution, Implementation/execution,\n1i. Evaluation/Validation/Testing\n1j. Improve/Modify/Amend/Revise\n\n2 ANALYSIS OF A SIMPLE PROBLEM IN A GIVEN CONTEXT\n2a. Mind Maps, \n2b. Affinity Mappings,\n2c. Empathy Mapping\n2d. User Story Mapping\n2e. Semiotic Analysis (Syntax-Semantic-Pragmatic)\n2f. Observations, Insights and Opportunities\n2g. Soft Prototyping the idea/concept\n2h. Documentation, report making and presentations\n", "3. DESIGN PERSPECTIVES : CONTEXT & CONCERNS\n3a. Understanding and defining 'Context' – Exposure to different perspectives, concerns and issues in the context of design.\n3b. Understanding and defining 'Concerns' – Fundamental yet subjective questions like what makes a good designer. Areas of concerns : social concerns, economic concerns, political concerns, environmental concerns etc \u2028\n3c. Tangible and Intangible relevance of broadening one’s perspectives in Arts Aesthetics, Science and Technology in Design.\n3d. The Challenges in Design - Designing for the Real World\n3e. Emerging Areas of Design.\n3f. Relevance of Design in the Context of India.\n3g. Importance of Sustainable Design Practices - Preserving traditional practices & designing for the underserved communities.\n3h. Wicked Problems.                                                                               ", "4. THE NOTION OF THE DESIGNER ‘SELF’ AND THE ‘OTHER/USER’\n4a. The Hierarchy of the ‘Other’\n\n5. PROBLEM STATEMENT \n5a. Framing the Problem with Rreference to Context; \n5b. Framing Research Questions \n5c. Framing the Design Process : Identifying Methodologies and Strategies related to the different stages of Problem Solving Process \n\n6. CREATIVE DESIGN THINKING METHODS \nIntroduction to various Techniques/Tools for Ideation: \n6a. Brain Storming, \n6b. Browsing, \n6c. Word Association, \n6d. Attribute Listing, \n6e. Mind Mapping, \n6f. Affinity Mapping, \n6g. Card Sorting, \n6h. 3 W & H, \n6i. SCAMPER, \n6j.  SWOT Analysis.", "7. VISUALISATION / CONCEPTUALISATION / IDEATION OF MULTIPLE SOLUTIONS\n8. SELECTION OF  3 OPTIMAL SOLUTIONS\n9. IMPLEMENTATION OF FINAL SOLUTION /EXECUTION OF FINAL SOLUTION", "10. CONTINUATION OF IMPLEMENTATION OF FINAL SOLUTION/EXECUTION OF FINAL SOLUTION INTRODUCTION TO DIGITAL TOOLS FOR PROTOTYPING\n", "11. VALIDATION/TESTING\n12. DOCUMENTATION MTHODS", "13. SELF-ACTUALISATION\n13a. Mapping of the Self based on Maslow's Hierarchy of Human Needs.\n13b. Mapping of Self based on Ownership of Position taken on Political, Social, Economic, Environmental, Technological, Health etc Issues.\n", "14. END TERM PROJECT – GROUP PROJECT\n14a. Complex Problem Solving / Solving Wicked Problems\n14b. Introduction to Sustainable Development Goals", "14. END TERM PROJECT – GROUP PROJECT\n", "14. END TERM PROJECT – GROUP PROJECT", "14. END TERM PROJECT – GROUP PROJECT", "14. END TERM PROJECT – GROUP PROJECT", "14. END TERM PROJECT – GROUP PROJECT"], "assessment plan": ""}, "Digital Audio.xlsx": {"course_desc": "This hands-on project-based course will introduce students to the world of digital audio. Topics include real-time sound synthesis, machine listening, procedural game audio, algorithmic composition, digital instrument design and sound design. Students will learn to code using SuperCollider, a programming language for real-time audio synthesis. In this course the students will conduct their own audio-based research projects inspired by the current work being done in the field of computer music & sound synthesis. As listening skills are essential and need to be developed, this class will expose students to new and often very challenging music, sounds and composers. Weekly programming, reading and listening assignments will be given. Students will be evaluated on both technical and creative ability in this course. ", "lecture topic": ["Intro to Digital Audio Theory & Acoustics", "1. Intro to SuperCollider and Digital Audio Programming\n2. SuperCollider Server Architecture\n", "Sound Synthesis: Additive, Subtractive, Modulation Synthesis, Filters\n", "1. Sequencing, Envelopes, Synthdefs, Routines, Clocks\n2. Digital Instrument Design\n", "1. Interaction and GUI Design in SuperCollider\n2. Computer Music History & Important Composers", "1. Sound Synthesis 2: Granular Synthesis\n2. Computer Music II & Important Composers", "Effects: Busses, Nodes and Effects", "Interaction 2 – Midi, OSC, Lemur, Wearable Technology ", "Algorithmic Composition: Patterns", "1. Sound Analysis: FFT & Machine Listening\n2. Cross Synthesis", "Digital Audio Workstations, Linear Editing and Sound Design\n", "Game Audio: Communicating with UE4 using Open Sound Control"], "assessment plan": "A33"}, "Digital Circuits.xlsx": {"course_desc": "Introduction to Digital Circuits. The aim of the course is to get the students thrugh the process of Digital Circuit Design after introducing the students to signal representation,Boolean Algebra, Logic Gates and Design with Logic Gates. Give them the awareness of Combinationaland Sequential Circuits and their Design approaches. The students will be exposed to Pipelining concepts and an introduction to Semiconductor Memories.", "lecture topic": ["Analog and Digital Representation of Information, Data vs. Signal, Information Processing Steps: Logic and Arithmetic (2hrs)", "Binary variables; Basic logic operations – AND, OR, NOT; Basic gates; Essentials of Boolean algebra; De Morgan’s laws; Truth Table; Boolean functions; (4hrs)Transforming a logical problem statement into a Boolean expression.(4 hrs)", "Positional number systems – Binary, Decimal, Octal, Hexadecimal; Signed number representations; Arithmetic operations.(4 hrs)", "Realisation of Boolean functions using gates; Karnaugh map; Minimisation of Boolean functions; Multiplexer-based realisation of K-maps; Combinational circuit design using multiplexers and gates. ALU (11 hrs)", "Latches and Flip-flops; Ripple counters; Sequence generator using flip-flops; State Table and State Diagram; Synchronous counters; Shift Registers; Ring and MLS counters.(10 hrs) ", "Pipelinig: Pipelining with Edge Triggered Flip Flop, Pulse Triggered Flip Flop and Latches. Intorduce the concepts of Skew and Jitter (4 hrs)", "Introduction to Semiconductor Memories (4 hrs)"], "assessment plan": "A23"}, "Econometrics II.xlsx": {"course_desc": "This course will provide training in advanced applied econometrics through two (broad) modules: A) Panel Data Analysis; and B) Microeconometrics.                                                                                                                                                      Panel data (or longitudinal data) run over time and for different observation units like individuals, households, firms, regions, countries, etc. The repeated nature of the individual-level data enables more realistic econometric modeling (e.g., incorporating dynamics at the individual level); more robust estimation methods (e.g., controlling for unobserved heterogeneity) and more powerful statistical inference procedures (e.g. testing for longrun purchasing power parity by pooling a number of countries). We will study the development of the linear regression model in panel data settings involving 'fixed' and 'random' effects, and the statistical propoerties of the relevant estimators.                                                                                                                   Microeconometrics is the study of economic behavior of individuals or firms by employing micro-level discrete response data and regression methods for panel data. The purpose of this module is to expose students to powerful econometric techniques frequently used in\napplied microeconomic research and quantitative policy analysis.", "lecture topic": ["Introduction to Panel Data Analysis: Advantages of Panel Data; Heterogeniety Bias; Selectivity Bias; Analysis of Covariance.", "Regression Methods for Panel Data: (a) Fixed effects models; (b) Random effects models; (c) serial correlation in panel data; (d) modeling arbitrary error structure using maximum likelihood estimation and generalized lease squares; (e) tests for model misspecification.", "Dynamic models with variable intercepts: MLE; GLS; and Instrumental Variable (IV) Estimator; Simulating standard errors.", "Discrete Data: Some discrete response models; Static models with heterogeneity; Dynamic discrete choice models (The general model, initial conditions, and state dependency versus heterogeneity).", "Microeconomic Data Structures: Observational data; data from social experiments; data from natural experiments; and some practical considerations", "Theory of probabilistic choice behavior: multiple alternative choice problems; independence of irrelevant alternatives (ordinal utilities versus scaled cardinal utilities); and  probabilistic nature of individual choices.", "Multinomial models: Additive random utility models (RUM); multinomial logit model; multinomial probit model                                                                                                                                ", "Ordered, Requential and Ranked Choice Outcomes: Random parameters logit; nested logit; conditional logit; multivariate discrete outcomes models", "Project presentations"], "assessment plan": "A27"}, "Embedded Logic Design.xlsx": {"course_desc": "This course will introduce students to the various programmable logic devices (PLDs) available in the market and get them started with how to program such devices to develop simple applications. First half of this course will cover FPGA programming using Verilog and second half will focus on ARM processor programming using C followed by an integration of ARM with FPGA using Zynq board.", "lecture topic": ["FPGA architecture and Verilog Basics", "Combinational logic design, Verilog testbench", "Synchronous and asynchronous logic design and arithmetic circuits, Advanced Verilog", "Finite state machines and Advanced Verilog\n\n", "FPGA Memory,  Zynq architecture (ARM + FPGA)\n\n", "Zynq architecture (ARM + FPGA), C programming for ARM\n", "Zynq architecture (ARM + FPGA), C programming for ARM\n"], "assessment plan": "A27"}, "Entrepreneurial Communication.xlsx": {"course_desc": "Communication for entrepreneurs implies improving their communication skills, sharing their ideas, politely and persuasively. Strategies involve presenting them clearly and precisely whether they are communicating with their staff, team members, clients and colleagues. Having good communication skills is crucial to entrepreneurs at the time of project explanation, elevator pitches, presentation, training as well as many other areas where a person has to be convincingly interactive and engage in dialogues with people. Effective communication is indispensable at all stages of entrepreneurial success, such as to generate an innovative idea; to communicate it to rest of the world; to organise a team and to materialise it in successful, profitable business ventures. Since communication as a whole plays a decisive role in entrepreneurial success, the course substantiates how effective communication plays a key role whereby entrepreneurs achieve the desired levels of excellence in the development of their organisations. Entrepreneurs face unique communication challenges when communicating with initial investors, business partners, founding employees, first customers, and the media. Students will apply course concepts to their own ideas while developing communication competencies in a variety of entrepreneurial communication contexts.", "lecture topic": ["FPGA architecture and Verilog Basics", "Combinational logic design, Verilog testbench", "Synchronous and asynchronous logic design and arithmetic circuits, Advanced Verilog", "Finite state machines and Advanced Verilog\n\n", "FPGA Memory,  Zynq architecture (ARM + FPGA)\n\n", "Zynq architecture (ARM + FPGA), C programming for ARM\n", "Zynq architecture (ARM + FPGA), C programming for ARM\n"], "assessment plan": "B30"}, "Entrepreneurial Khichadi.xlsx": {"course_desc": "This course familiarises students with fundamentals of entrepreneurship, and is relevant for students who are aspiring to be entrepreneurs or want to get exposed to concepts of entrepreneurship which will be beneficial to them in any job that they plan to take up after their graduation.  The key elements of entrepreneurship will be introduced, such as entrepreneurship spirit that entails attributes such as flexibility, core values of ethics and integrity, passion to solve a real business problems, empathy, achievement orientation, customer focus, importance of collaborative approach, etc.  Importance of teaming will be taught, that will cover topics related to building a team that has complementary skills, aligning goals of various team-members, hiring of the initial employees, leadership skills, etc. The course will also introduce key areas that are extremely important to build a startup; such as creativity and innovation, marketing, product design and prototype, competitive analysis, business model, business plan, go-to-market strategy and revenue models, managing cash-flows, valuation methodology, raising funds and preparing investor pitch, intellectual property and legal aspects, building sustainable business, etc.  As some of these topics will be covered in greater depth in a few other core/elective courses, the objective will be to ensure that there are minimal overlaps with the content of other courses while ensuring that relevant connects are made to specific areas that are important for entrepreneurship. The course will encourage team-based method of learning. In the beginning of the course, teams of 2-3 students will be formed which will develop ideas for a venture.  They will then create a real world business plan based on this idea.  Teams will present relevant portions of their business plan to the class for analysis and discussion.    ", "lecture topic": ["Key elements of Entrepreneurship", "Building entrepreneurial teams (create student teams for class projects)", "Leadership skills, hiring of core employees, aligning goals to business objectives", "Creative thinking and innovation", "Product design and prototype", "Marketing and Competitive Analysis", "Entrepreneurial case studies and team presentations", "Business model, go-to-market strategy and revenue models", "Financial aspects, managing cash-flows and unit economics", "Intellectual property and legal aspects", "Elements of investor pitch, raising funds and valuation methodology", "Prepare business plans for initial discussions", "Final project presentations"], "assessment plan": "A32"}, "Film Making and Radio Podcasting.xlsx": {"course_desc": "You cannot be a good film maker if you don’t know how to edit audio sound track and video film footage. One of the worlds greatest film maker Eisenstein stated: \"Cinematography is, first and foremost, montage.\" Eisenstein believed that film montage could create ideas or have an impact beyond the individual images. Two or more images edited together create a \"tertium quid\" (third thing) that makes the whole greater than the sum of its individual parts. Similarly Alfred Hitchcock  said “For me, cinema is essentially emotion. It is pieces of film joined together that create an idea, which in turn creates an emotion in the mind of the audience. Not through spoken words, but through the visuals. It's a visual medium. And montage is the main thing. All moviemaking is pure montage.\" It is believed by some that good films are made more on the editing table. This course will not only give you the basic technical skills but will also hand hold you into making a aesthetically correct decisions in assembling a film ", "lecture topic": ["NLE Audio Overview", "Audio File Format", "Audio Codecs", "Audio Mastering", "Musical Terms", "Harmonics", "Scripting Audio Podcasts", "Video Formats", "Picture Composition", "History of Film Making", "Developments in Editing, Hollywood and Soviet Montages Montage", "Continuity Editing"], "assessment plan": ""}, "Finite and spectral element methods.xlsx": {"course_desc": "This is an introductory course to mathematical theory behind finite and spectral element methods for solving differential equations. Students will get an idea about high order numerical approximations of partial differential equations with applications to complex geometries.                                        We begin with different function spaces, weak derivatives to analyze a   differential equation in minimal regularity setup. Then we discuss variational formulation which can be used for finite and spectral formulation of the problem. After that we focus on polynomial approximation theory which helps us to obtain error estimates. We end the course with variational formulation for Stokes and Navier-Stokes equations and challenges invloved in computation of these system of differential equations.                  ", "lecture topic": ["\nIntroduction to distribution theory", "Introduction to Sobolev spaces\n", "Variational formulations for differential equations", "Finite element formulation for one dimmensional problems", "Polynomial approximation theory", "Introduction to spectral elements : Fundamental concepts in one dimension", "Error estimates with hp elements, Implementation of one-dimensional spectral element solver", "Introduction to multi dimensional spectral elements, Implementation of a two dimensional spectral element solver for Laplacian/Helmoholtz problem", "Introduction to least squares finite and spectral element method", "Variational formulations for Stokes and Navier Stokes equations"], "assessment plan": "A23"}, "Foundations of Finance.xlsx": {"course_desc": "Finance is, in a real sense, the corner stone of the enterprise system – good financial management is vitally important to the economic health of all firms and hence to the nation and the world. Because of its importance, finance should be widely and thoroughly understood. The field is complex and it undergoes constant change due to shift in economic conditions. All of this makes finance stimulating and exciting, but challenging and sometimes perplexing. This course aims at creating a better understanding of the financial system.", "lecture topic": ["Time Value of Money", "Elements of Balance Sheet, Income statement and Cash Flow Statements", "Capital Budgeting", "Cost of Capital", "Financing Decision", "Dividend Decision / Working Capital Management"], "assessment plan": "A22"}, "Game Theory.xlsx": {"course_desc": "Game Theory is a fundamental analytical tool in Economics alongwith Price Theory. Game theoretic modeling and strategic analysis as a distinct methodology has been a major intellectual achievement of the past century not only within the Economics discipline but more broadly in the Social Sciences. The course requires and further develops conceptual thinking as well as problem solving abilities of students. ", "lecture topic": ["Prisoners' Dilemma, Tragedy of the Commons and Solutions, Rational Choice", "Expected Utility Theory, Extensive Form Games , Concept of a Strategy, Strategic Form Games", "Dominance and Best Response, \nRationalizability and Iterated Dominance", "Rationalizability Applications", "Nash Equilibrium and  Applications", "Mixed Strategy Nash Equilibrium and Applications", "Sequential Rationality and Subgame Perfect Equilibrium ", "Subgame Perfect Equilibrium: Applications", "Bargaining Theory and Applications ", "Repeated Games", "Games with Incomplete Information", "Applications", " Applications", " "], "assessment plan": "A38"}, "Gender and Media.xlsx": {"course_desc": "Everyone around us is talking about the TV show Game of Thrones (GoT), isn’t it? But ever wondered that in GoT, land and titles are being passed in the male bloodline while the women are married off for political reasons and alliances? The former are mostly depicted as violent, muscular, powerful and aggressive while the latter as being submissive, dependent, innocent and sexualised. In varying forms and degrees these characterisations are replicated across various media platforms.  Drawing primarily from sociology and supporting literature from media studies, cultural studies, feminist theory, and internet/new media studies, the course on gender and media will introduce students to mediated construction and presentations of gender through engagement with representations of masculinity, femininity and sexualities, and their intersectionality with class, race, ethnicity and caste, in print and electronic media. The course will interrogate the political economy, diversity and the composition of labour market of media industry to understand gendered power inequalities in media. Instagram and Facebook content will be examined to probe questions around how media becomes an important means for self-presentation, power, assertion and identity formation. The course will also discuss issues of digital spaces, safety and risk through an engagement with issues of cyber misogyny and gendered online activism by drawing on contemporary examples of hashtag activism namely #metoo, #youtoo, #notallmen and #blacklivesmatter. Grounded in learning by doing, an important part of the course will be to train students to not just become critical consumers but also responsible producers of media. The course will involve assignments and activities on content analysis of television sitcoms, advertisements, Bollywood and regional cinema, print media and digital platforms (blogs, vlogs, avatars) to analyse gendered and racialized language and embodiment in the construction of identities. All the writings that the students do will be used to create a blog on interrogating media from a gender lens. \n", "lecture topic": ["Introducing: Sex, Gender and Sexuality", "Themes and Approaches", "Social Construction of Reality", "Performing Gender: Social norms, everyday lives & media", "Sexuality, Ideology and Representation", "Feminist Media Studies", "Masculinity and Popular Culture", "Representation of Alternative Sexuality in Media", "Intersectionality: Class, Race and Gender", "Indian Context: Gender & Social Media", "Gendered Advertising", "Gendered Online Activism & Violence", "Summing up and Review"], "assessment plan": "A29"}, "Genetics-and-Molecular-Biology.xlsx": {"course_desc": "The aim of this basic core course is to provide students a good background in genetics, molecular biology.  The major focus is to acquaint students with quantitative aspect of different kind of genetic inheritance and horizontal transfers. The course is also to provide introduction about different aspect of molecular aspect of gene regulation.", "lecture topic": ["An Introduction to DNA structure and variations, quantitive Genetics, statistical aspect of mendelian inheritance and non-mendelian genetics, gene interaction based moifications (epistasis). Bacterial and Viral gene transfers evolution, tranferable elements in eukaryotic genome\n\n\n", " Detail of Gene regulation /contol of gene expression in prokaryotes and eukaryotes, introduction to epigenomics, proteomics", "Detail of Molecular biology aspect of epigenome and proteome invloved in regulation, transcription factors", " Introduction to population genetics", "Iintroduction to developmental genetics", " Introduction to sources of data in genomics, proteomics and population genetics for quantitaive analysis"], "assessment plan": "A22"}, "Healthcare Innovation and Entrepreurship Essentials.xlsx": {"course_desc": "The objective of this course is to introduce students to the Healthcare Innovation with a specific focus on Digital Health and Entrepreneurship. It covers Biotechnology, Medical Device and Digital Health/IT. The course will aim to generate healthcare startup ideas after identifying the gaps and opportunities in the Indian and US ecosystem. ", "lecture topic": ["Healthcare Value Chain", "Healthcare Innovation Ecosystem", "Digital Health/IT startups- gaps, opportunities, regulations", "Biotech startups- gaps, opportunities, regulations", "Medical devices startups- gaps, opportunities, regulations", "Growth hacking your health venture"], "assessment plan": "A27"}, "Human Centred AI.xlsx": {"course_desc": "This course will provide a detailed understanding of the fundamentals of Human-Centred AI (HAI) including how to design understandable, fair, and transparent AI systems.", "lecture topic": ["Introduction to Human-AI Interaction", "Understanding Automation and Augmentation from a User Perspective", "Translating User Needs into Data Needs", "Interacting with an AI system", "Explainability and Trust", "Feedback and Control  ", "Student Reading Presentations and Discussions"], "assessment plan": "A31"}, "Information Integration and Applications.xlsx": {"course_desc": "Strictly typed data in an enterprise can be meaningfully decomposed at a fine granularity and stored in a relational database. Such data is mostly operational business data (e.g. sales, accounting, payroll, inventory), and has been the mainstay of database systems since their inception. Enterprises have gathered this information (based on the view defined) from multiple data sources and stored it in a central repository, called data warehousing, for decision support functionalities and data analysis. This kind of analysis is best-suited when the support for decision making is based on the historical or point-in-time view of the business, not on a (near) real-time view and/or knowledge. Since the “structured” data constitutes only a fraction of the entire information content within an enterprise, which also includes “unstructured” content like reports, email, meeting minutes, web-pages etc, the enterprises are now realizing to integrate their entire information sources across structured and unstructured data sources.  \n\nThe objective of this course is to cover the various methods of integrating homogeneous and heterogeneous information (structured/semi-structured (XML) and unstructured) through schema integration (virtual and materialized), entity extraction and matching, etc.  This course will be equally focused on implementation and developing an application to demonstrate the leaned techniques for new ways to integration information. These technologies will be useful in several information integration applications domains, such as financial services, retails, telcos, social analytics, legal and compliance, and customer relationship management. These applications may require integration of information (in real-time) based on events and business policies.", "lecture topic": ["Data Warehousing System: Integration Models and Maintenance", "Homegeneous Information Integration (Virtualization, Mediator and Materialization approaches)", "Policy Based Information Integration (Architecture, Policy Syntax and Semantics, Policy Execution Engine) ", "XML Data Integration", "Context-Oriented Information Integration", "Stream Information Integration", "User Centric Information Integraion", "Projects outcome presentation"], "assessment plan": "A31"}, "Integral Transforms and their Applications.xlsx": {"course_desc": "The course is designed as an introduction to the theory and applications of integral transforms to problems in linear differential equations, and to boundary and initial value problems in partial differential equations. The course assumes very limited knowledge of vector calculus, ordinary differential equations, complex variables contour integration, partial differential equations and continuum mechanics. Many new applications in applied mathematics, physics, chemistry, biology and Engineering are included. This course will serve as a reference for advanced study and research in this subject as well as for its applications in the fields of neuroscience, signal processing, informatics and communications. The course is open to all MTech, PhD students and some advanced undergraduates, honors students through instructor consent.", "lecture topic": ["Basic concepts of integral transforms.\nFourier transforms: Introduction, basic properties, applications to solutions of ODEs, PDEs.", "Fourier sine and cosine transforms, application to solutions of PDEs, evaluation of definite integrals.\nLaplace transforms: Introduction, existence criteria", "Laplace transforms: Convolution, differentiation, integration, inverse transform, Tauberian Theorems, Watson’s Lemma, solutions to ODEs, PDEs (IVP, BVP).", "Applications of joint Fourier-Laplace transform, definite integrals, summation of infinite series, transfer functions, impulse response function of linear systems.\n", "Hankel Transforms: Intro, properties and applications to PDEs                                                                                     Mellin transforms: Intro, properties, applications; Generalized Mellin transforms.\n", "Hilbert Transforms: Intro, definition, basic properties, Hilbert transforms in complex plane, applications; asymptotic expansions of 1-sided Hilbert transforms.\n", "Stieltjes Transform: definition, properties, applications, inversion theorems, properties of generalized Stieltjes transform.     Legendre transforms: Intro, definition, properties, applications.   ", "Z Transforms: Intro, definition, properties; dynamic linear system and impulse response, inverse Z transforms, summation of infinite series, applications to finite diff. eqns.\n\n", "Radon transforms: Intro, properties, derivatives, convolution theorem, applications, inverse radon transform", "Fractional Calculus and its applications: Intro, fractional derivatives, integrals, laplace transform of fractional integrals & derivatives,", "Integral transforms in fractional equations: fractional ODEs, integral equations, IVPs for fractional DEs, fractional PDEs, green’s function for fractional Des", "Additional problem solving sessions", "Some additional topics (external visitor): Orr-sommerfeld equation, Proper Orthogonal Decomposition"], "assessment plan": "A34"}, "Integrated Circuit Fabrication.xlsx": {"course_desc": "In this course fundamental  physical and chemical processes will be used to describe and model a range of  fabrication processes making up the various silicon integrated circuit technologies. This course covers everything that professionals need to know, from crystal growth to integrated devices and circuits. Both theory and the practical aspects of each major fabrication step, including crystal growth, silicon oxidation, photolithography, etching, \ndiffusion, ion implantation, and thin film deposition will be covered in this course.\nIt is assumed that students have a quantitative  understanding of the basic device physics and structure of diodes, bipolar junction  and field-effect transistors\n", "lecture topic": ["Introduction to Semiconductor Fabrication, IC Production Cycle, Semiconductor materials and their properties\n", "Crystal structure, crystal axis and plane, crystal defect and defect electronic properties  \nCrystal Growth – Elementary material, growth from liquid and doping in liquid state"], "assessment plan": "A39"}, "Introdcution to Functional Analysis.xlsx": {"course_desc": "Functional analysis is the next step after linear algebra. In linear algebra, you deal with vectors which lie in a finite-dimensional space. What if these vectors come from an infinite-dimensional space? Can we still apply the results we have learned in linear algebra or they breakdown? This course offers answers to some of these questions. When you go beyond linear algebra, you require a more rigorous analytical framework and that's why this course is called \"Functional analysis\". It is a vast subject and this course is designed to introduce students to this area. Functional analysis is a valulable tool in theoretical mathematics as well as engineering and it is at the very core of numerical simulation. The course should be accessible to any advanced BTech, MTech or PhD student of any department who has some training in linear algebra and real analysis.", "lecture topic": ["Review of vector spaces, Normed spaces, Linear operators", "Dual spaces, Hahn-Banach theorem", "Cantor intersection theorem, Baire Category theorem", "Open mapping theorem, Closed graph theorem, Uniform boundedness principle\n \n", "Weak, weak* and strong topologies, Alaoglu's theorem", "Inner product spaces, Orthonormal bases", "The adjoint operator, Riesz Representation theorem", "L^p spaces", "Sobolev spaces", "Distributions", "Distributional solutions of PDEs", "Compact operators", "Spectral theory of compact operators"], "assessment plan": "A35"}, "Introdcution-to-3D-product-design-for-Animation-and-Games_Monsoon-2019_.xlsx": {"course_desc": "This course introduces students to: \n(i) Introduction to Geometrical and objective Drawing\n(ii) Basics and fundamental of Design for Animation\n(iii) Designing assets and character for Animation and Game\n(iv) Exporting Assets to Game Engines", "lecture topic": ["Introduction to Drawing", "Basics of structural drawing", "Character and Asset Design", "Introduction to Digital Tool", "Introduction to 3D Sculpting in Maya", "Introduction to surface mapping and Lighting", "Basics of Rigging and Skinning", "Exporting Assets to Game Engine and Project Render"], "assessment plan": ""}, "Introduction to Motion Graphics.xlsx": {"course_desc": "This course introduces students to: \n(i) Define functions and significant of Motion Graphics\n(ii) Introduction to the principles of motion graphics production.\n(iii) The basic software/tools used in the manipulation and control of motion graphics.\n(iv) Developing own a short visual story from a script.", "lecture topic": ["Introduction to Motion Graphics", "Introduction to Visual Storytelling and Info Graphics tools", "Typographic Design and Design Fundamentals", "Visualization for Motion Graphics and Concept Development", "Template Creations and Effects Animation", "Motion Graphics Theams, Sound and Camera", "Basic Character Animation", "Understanding of Different File formate, Render a project"], "assessment plan": ""}, "Introduction to Philosophy.xlsx": {"course_desc": "This course introduces students to: \n(i) Define functions and significant of Motion Graphics\n(ii) Introduction to the principles of motion graphics production.\n(iii) The basic software/tools used in the manipulation and control of motion graphics.\n(iv) Developing own a short visual story from a script.", "lecture topic": ["Overview of the history and areas of western philosophy. {\"Philosophy begins and ends in wonder\" - Aristotle and Whitehead}. From the pre-Socratic philosophers to the present day.", "Introduction to metaphysics - Plato and Aristotle. The parable of the cave and the theory of forms. Connections between Plato's metaphysics and political philosophy. Aristotle's metaphysics and political philosophy.", "Introduction to meta-ethics, 2 basic approaches: consequentialist and deontological. The utilitarians and Kant. Issues in cyber ethics.", "Learning team Presentations", "Cyber ethics continued. Introduction to epistemology. Rationalism and empiricism as 2 schools of thought that deal with the problem of knowledge. Descartes. Locke, Berkeley, Hume. Wittgenstein, Foucault and the unravelling of epistemology. Genealogy and sociology of knowledge replace epistemology.", "Antiphilosophy' - the work of the later Wittgenstein, Foucault and Derrida", "Introduction to critical thinking and logic", "Philosophy of religion - A basic introduction. Selections from mystical texts including the Ashtavakra Gita, Rumi, select Christian and Gnostic mystics and buddhists writings", "An introduction to the philosophy of science. Karl Popper and Thomas Kuhn", "Learning team Presentations", "Philosophy of literature and aesthetics.", "Overview of social and political philosophy", "Wrap up"], "assessment plan": "A35"}, "Key Concepts in Economic Sociology(Updated version).xlsx": {"course_desc": "Traditional economic analysis takes the rational individual as its starting point. Economic Sociology on the other hand encourages students to see rational self-interest and action as embedded in society, influenced by group dynamics, legal institutions, power, organizations and even culture. It justifies the application of independent sociological methods and concepts to the examination and understanding of the Economy as a sphere of production, consumption and exchange of goods and services, which is observable in all human societies, not only the modern and advanced. It thereby encourages students to relate economic actions to all other forms of social actions observable in society – the religious, the familial, the technological and the political. In sum, Economic sociology identifies the obligatory, symbolic and power seeking motivations underlying human economic action, not only the useful or utilitarian.  \nThic Course provides students with a corrective perspective. It re-ignites awareness of fundamental questions and looks to the contributions of thinkers like Karl Polanyi, Marcell Mauss and Granovetter and Swedberg to reconsider our assumptions on how we produce,consume and exchange, and live.\n", "lecture topic": ["Introduction to Economic Sociology", "Brief histories of Economics and Sociology\n", "Formalism and Substanvism in Economic Sociology- Karl Polanyi\n", "Economies and Culture", "New Economic Sociology- Embeddedness- Granovetter", "New Traditions of Economic Sociology- Swedberg", "Forms of Exchange: Gifting \n", "Forms of Exchange: Reciprocity", "Understanding Markets- social meanings", "Understanding Money- Social meanings", "Development in Economic Sociology ", "Globalisation in Economic Sociology", "Summing up:Globalization and after"], "assessment plan": "A35"}, "Low Voltage Analog Circuit Design.xlsx": {"course_desc": "Introduction - Why analog or digital? Why low voltage and low power? Why CMOS? Techniques to reduce the power consumption and the voltage supply, Analog techniques, Digital techniques, Different techniques to reduce the supply voltage and power consumption,\nCurrent Conveyor (CC) - Introduction, Characteristics, Circuit implementations, Low voltage CCs Structure, Applications and design techniques\nThe Floating Gate MOS transistor (FGMOS) - Introducing the device, Designing with FGMOS, Problems and solutions, Simulation, FGMOS – Equivalent Circuit, Applications and design techniques\nLow voltage analog continuous-time filtering - CC based  based using CMOS and FGMOS transistors, Transconductor basic blocks,Gm-C multiple-input linear integrator, Common Mode Feedback Block (CMFB), Transconductance cell, Tuning amplifier, Filter example \nLow voltage multiplier, Mixer and LNA Circuits", "lecture topic": ["Need for low voltage analog and digital circuit design, Different analog circuit design techniques     ", "Current conveyors, its characteristics, different types of CCs, circuit implementions and applications", "The Floating Gate MOS transistor (FGMOS),  - Introducing the device, Designing with FGMOS and problems associated in designing circuits and their solutions, simulation techniques, FGMOS applications and design techniques", "Low voltage analog continuous-time filtering - CC based filters using CMOS and FGMOS transistors, Transconductor basic blocks, Gm-C multiple-input linear integrator, Common Mode Feedback Block (CMFB), Transconductance cell, Tuning amplifier, Filter example ", "Low votage mixer and analog multiplier", "LNA circuits"], "assessment plan": "A31"}, "Macroeconomics.xlsx": {"course_desc": "This course will introduce basic models of macroeconomics along with real-world examples from various industrialized and developing economies. It will provide a unified framework to analyze aggregate behavior of agents in an economy using aggregate demand and supply analysis. We will study the impact of monetary policy and fiscal policy options on economic growth, labor market wages, income distribution, exchange rates, etc. in the short-run, medium-run, and long-run. ", "lecture topic": ["Introduction to Macroeconomics", "Measuring GDP, Growth and Prices", "Inflation and unemployment", "The Goods Market (Aggregate Demand and Aggregate Supply)", "Midterm 1", "The Goods Market (Aggregate Demand and Aggregate Supply)", "Capital Investments and Savings", "Fiscal Policy and Budget Deficits", "Money Market, Banking, and Monetary Policy", "Midterm 2", "Government Debts and Deficits. Exchange rates and the Balance of Payments.", "Economic Growth in the Long-Run", "Review of syllabus"], "assessment plan": ""}, "Micoreconomics.xlsx": {"course_desc": "This course involves formal introduction to the fundamentals of microeconomic theories of consumer and firm behavior. We will develop an understanding of the optimal decisions subject to limited budgets, technological barriers, and capacity constraints ofn production. We will gain an appreciation for the role of markets in resource allocation and learn the necessary conditions for markets to foster efficient allocation of scarce resources. We will study the the role of government policies regarding tax/subsidy and the response of consumers and firms that may raise or lower market efficiency.", "lecture topic": ["Review: Mathematical Tools", "Consumer Economics: The Concept of Utility", "Budget Cobstraint, Utility Maximization Problem", "Demand Curve, Indirect Utility Function", "Expenditure Minimization Problem", "Consumer Surplus", "Production Economics: Production Set and Production Technology", "Cost Minimization Problem", "Profit Maximization and Producer Surplus", "Market Equilibrium, Market Strucutre and Welfare Economics", "Advanced Topics: Risk & Uncertainty; Market Failure; Game Theory", "Advanced Topics: Risk & Uncertainty; Market Failure; Game Theory", "Group Presentations"], "assessment plan": "A35"}, "Mobile _ Middleware Systems.xlsx": {"course_desc": "This objective of this course is to train students in building mobile and middleware systems that are relevant for variety of domains, including but not limited to, crowdsensing, crowdsourcing, public helath, education, etc.  The course will teach contemporary middleware systems in practice and associated technologies to implement them. We will specifically be targetting middleware for unstructured data captured by mobile devices.  Computer Science as well as Design students will benefit from in-depth understanding of how Middleware works and as well developing the capacity to develop them. We would discuss middleware related issues for data collection, data privacy, data processing, analysis, and Visualization etc. Students are expected to have programming skills to program on Mobile Devices and Cloud. In this course, they will learn NoSQL databases, RESTful Web Services, Mobile based data collections - critical components of building Mobile Middleware Systems. Students will also be asked to read research papers from venues like Mobisys, Middleware, Sensys, CHI, etc.", "lecture topic": ["Introduction to Middleware Systems and technologies ", "Middleware Systems in Practice, e.g., ODK, Amazon", "Restful Architecture", "REST web services", "REST web services", "NoSQL Databases - Document-based and Graph based", "NoSQL Databases - Document-based and Graph based", "NoSQL Databases - Document-based and Graph based", "Mobile-based Data collection - lightweight mobile databases", "Mobile-based Data Management - caching methods, query handling during intermittent connections, peer-to-peer resoruce management", "Mobile-based Data Management - caching methods, query handling during intermittent connections, peer-to-peer resoruce management", "Middleware Systems in Research, Project presentation", "Middleware Systems in Research, Project presentation"], "assessment plan": "A37"}, "Natural Language Processing.xlsx": {"course_desc": "This course will cover a broad range of topics related to NLP, including basic text processing (such as tokenization, stemming), language modeling, morphology, syntax, dependency parsing, distributional and lexical Semantics, sense disambiguation, information extraction etc. We will also introduce underlying theory from probability, statistics, machine learning that are essential to understand fundamental algorithms in NLP such as language modeling, HMM etc. This course will end with more advanced topics in NLP such as stylometry analysis, sentiment analysis, named-entity disambiguation, machine translation etc. The term projects will provide opportunity to the students to get hands-on experience on designing different real-world NLP models.", "lecture topic": ["Introduction,  Regular Expressions, Text Normalization, and Edit Distance", "Regular Language & FSA", " Morphology & Finite-state Transducers", "Probabilistic models & Spelling correction", "N-grams, smoothing and entropy", "HMM, viterbi and A* decoding", "Word classes and POS tagging", "CFG for English and Parsing ", "Semantics: Introduction & Distributional semantics", "Lexical semantics & Word Sense disambiguation", "Advance topics: Text classification, Text Summarization", "Advance topics: Sentiment analysis,  Stylometry analysis", "Advance topics: Word embedding, NER, Concluding remarks"], "assessment plan": "A38"}, "Network Security.xlsx": {"course_desc": "The course on Network Security covers essentials of symmetric-key cryptosystems based on block ciphers (such as DES, AES), stream ciphers (such as RC4), public-key cryptosystems based on RSA and ElGamal, key management (including PKI and Certification), message authentication and digital signatures. Applications of these cryptosystems to securing Wi-Fi networks, Email systems, virtual private networks, or providing authentication & message integrity within an organization based on Kerberos or at Transport-layer while access the Web.", "lecture topic": ["Basic concepts covering security services, mechanisms, threats, etc.", "Symmetric-key cryptography, Block cipher DES, Triple DES", "AES block cipher ", "Key Distribution", "Public-key cryptography: RSA", "Diffie-Helman based Key generation", "ElGamal Cryptography, and Intro to Elliptic Curve Cryptography", "Key management: PKI and public key certification", "Applications to network security: WiFi security", "Kerberos-based authentication", "VPN, or IPSEC", "Transport-layer authentication", "Email systems", "LAN management, monitoring", "Firewall programming"], "assessment plan": ""}, "Neuroscience of Decision Making.xlsx": {"course_desc": "The course will introduce how perception,  goals, preferences, motivation of living systems guide their selection of actions and thoughts from several possible options. The course will try to build a mechanistic understanding of the processes in the brain that support decision making and how they are flexibly updated in a dynamically changing environment. Classes will discuss relevant scientific & historical background, salient theoretical models and experimental evidence in various aspects of decision-making. An additional component will involve computational analysis of experimental datasets in this field to make inferences about brain and behaviour. The primary effort would be to make neural mechanisms accessible to the learners, expose them to possible applications and encourage them to find their own avenues of interest for translating the core principles of decision neuroscience.", "lecture topic": ["Basic neural structures and networks behind Decision Making  ", "Basics of neural information coding ", "Methods of investigating neural Decision Making  ", "Methods of investigating neural Decision Making  ", "Neural Models of Decision Making ", "Neural Models of Decision Making ", "Neural basis of Perception based Decision Making ", "Neural basis of Motivation based Decision Making", "Neural basis of Value based Decision Making ", "Neural basis of Social Decision Making ", "Neural basis of Affective Decision Making ", "Physiological factors influencing Decision making ", "Individual differences in Decision making "], "assessment plan": "A30"}, "New Media and Politics.xlsx": {"course_desc": "The course will introduce how perception,  goals, preferences, motivation of living systems guide their selection of actions and thoughts from several possible options. The course will try to build a mechanistic understanding of the processes in the brain that support decision making and how they are flexibly updated in a dynamically changing environment. Classes will discuss relevant scientific & historical background, salient theoretical models and experimental evidence in various aspects of decision-making. An additional component will involve computational analysis of experimental datasets in this field to make inferences about brain and behaviour. The primary effort would be to make neural mechanisms accessible to the learners, expose them to possible applications and encourage them to find their own avenues of interest for translating the core principles of decision neuroscience.", "lecture topic": ["Explaining Populism & technological determinism", "New' mediation: Worldwide trends in internet use and popular politics", "Key concepts 1:Occupy as spatial politics", "Key concepts 2: Communicative power and social movements", "Key concepts 3: Collective identity in the era of 'Networked individualism'", "Historical and political origins of the internet based activism", "Populism and the rise of Twitter in the American politics ", "Popular revolts in the Arab world", "New populism in East Europe and post-Communist world", "Social media and rise of AAP in urban India", "Journalism and 'post-truth' politics in South Asia", "XR: Networked environmental action and climate politics", "Media policy in the age of populist politics"], "assessment plan": "A31"}, "Parallel Runtimes For Modern Processors.xlsx": {"course_desc": "Computing hardware is becoming more and more complex. Today and in the foreseeable future, performance will be delivered principally in terms of increased hardware parallelism. Modern processors today scale to over one hundred cores, maintains a complex memory hierarchy, and even share the memory with integrated accelerators such as GPU. Conventional programming models using threads impose significant complexity to organize code into multiple threads of control, and to balance work amongst threads to ensure proper utilization of computing resources. This shortcoming has helped the advent of parallel runtimes that assist the programmer by efficiently scheduling the  asynchronous tasks over available resources. This course introduces the design and implementation of such a parallel runtime and explores the challenges in achieving performance over modern processors.", "lecture topic": ["Task parallel runtime systems and optimizations: introduction to parallel architectures, work-stealing scheduling over multicore processors, optimizations for managing scheduling overheads, scalable datastructures", "Performance over Non Uniform Memory Access (NUMA) processors: dynamic profiling using linux performance counters, runtime supported trace and replay of iterative parallel programs, NUMA aware locks", "Energy efficient runtimes: work-load aware Dynamic Voltage and Frequency Scaling (DVFS), dynamically changing thread count in parallel runtime", "False sharing: automatic detection and avoidance of false sharing ", "Resilency: efficiently supporting resiliency in runtime systems", "Heterogeneous runtime: unified runtime for Integrated CPU-GPU processors, automatic task partitioning across multicore CPUs and integrated GPU", "Advanced optimizations: Applying maching learning techniques in parallel runtimes"], "assessment plan": "A31"}, "Perspectives of Knowledge.xlsx": {"course_desc": "Computing hardware is becoming more and more complex. Today and in the foreseeable future, performance will be delivered principally in terms of increased hardware parallelism. Modern processors today scale to over one hundred cores, maintains a complex memory hierarchy, and even share the memory with integrated accelerators such as GPU. Conventional programming models using threads impose significant complexity to organize code into multiple threads of control, and to balance work amongst threads to ensure proper utilization of computing resources. This shortcoming has helped the advent of parallel runtimes that assist the programmer by efficiently scheduling the  asynchronous tasks over available resources. This course introduces the design and implementation of such a parallel runtime and explores the challenges in achieving performance over modern processors.", "lecture topic": ["Introduction to the Course; \nIntroduction to the question of knowledge. Setting the frames of the course. Discussion of the syllabus.\nPlato’s parable of the Cave in the ‘Republic’. Introduction to Plato’s Dialogue “Theaetetus”; The Question: What is Knowledge; The Argument: Why perception is not knowledge; The method of Socratic argument; the philosopher as a ‘midwife’.\n", "\nIntroduction  to modern epistemology.\nDescartes, Locke, Berkeley, Hume. The Cartesian ‘evil genius’ and the Cogito.\nThe problem of philosophical skepticism.\n", "British empiricism continued. Kant’s ‘solution’ to the Humean dissolution of knowledge. ", "Distinction between rationalist and empiricist models of knowledge", "Buddhist epistemology: a discussion.", "Jnana and Pramana: a discussion", "Discussion of Indian and Western perspectives on knowledge. ", "Ludwig Wittgenstein: Logical atomism, and beyond. The philosopher as a fly trapped in a fly bottle.", "Copernican Revolution;\nGalileo’s arguments and methods. Thought experiment. Observation and Experiment. Galileo and the Church – book of nature and the book of God.\n", "Galileo’s arguments and methods. Thought experiment. Observation and Experiment. Galileo and the Church – book of nature and the book of God.", "Poststructuralist models of knowledge. Michel Foucault and the anchoring of the sciences and various social practices in discourses of power. Sexuality and knowledge.", "Wrap up of the poststructuralist position.", "\nInternet and Knowledge. Knowledge and Freedom. Knowledge as property and knowledge commons. \n\nHuman Being as an Epistemic (knowledgeable) Being. Knowledge in Society.\n"], "assessment plan": "A35"}, "Photonics Fundamentals and Applications.xlsx": {"course_desc": "Photonic components form the back-bone of any optical communication system. Thus, a solid understanding of the theory and design methodology of these components is of paramount importance. The course is designed in such a way that the students (already working/aiming to work on Optical Communication, Electromagnetic band-gap materials, Metamaterials, optical sensing and different areas of photonics) get a good grasp of the widely-used photonic components that have been used so far and at the same time, they are exposed to state-of-the-art designs of optical sensors and planar, on-chip photonic devices. Besides class-room lectures, I plan to take some lab-lectures where the students will learn and implement the state-of-the-art and by far, the most accurate design tool (in my knowledge) developed by Prof. Steven G. Johnson's photonics group at MIT.", "lecture topic": ["Review of Maxwell's equations, Boundary conditions at the interface between two media, Polarization of light-wave, TEM, TE and TM modes", "Origin of refractive index, Optical pulse propagation in a dispersive medium, Ray-optics approximation", "Transfer matrix method in ray-optics, Optical components and their transfer matrices: beam-splitter, polarizer, mirror. Optical components: Interferometers", "Laser and photodiodes", "Surface plasmon at metal-dielectric interface, LSPR, Plasmonic sensors", "Brief introduction to FDTD, numerical dispersion. ", "Lab: MIT Electromagnetic Equation Propagation (MEEP)", "Designing planar and nano-particle based plasmonic sensors in MEEP", "Molding the flow of light, Bloch's theorem, Photonic band-gap (PBG) concept", "1D, 2D and 3D photonic crystals, Lab: Introduction to MIT Photonic Bands (MPB)", "Lab: Line-defect in a 2D photonic crystal and design of on-chip optical waveguides.\nLab: Point-defect in a 2D photonic crystal and design of on-chip, high-Q optical resonators. "], "assessment plan": "A37"}, "Prototyping Interactive Systems.xlsx": {"course_desc": "Introduction to Engineering Design is a multidisciplinary course offered with an aim to ignite your mind with concepts in design and innovation as well as engineering skills needed to build physical prototypes. This hands-on learning course is divided into 3 parts: In the first part, you will learn to work with microcontrollers, smartphones, low-cost materials, and power tools through several in-class activities and lab exercises. In the second part, you will apply these skills to a two-week long minor group project for a given design brief. The last part of the course is dedicated to the realization of an open-ended major group project. For this project, you will identify a problem, preferably having a social impact, plan your project and, finally, build a functional solution. The course culminates with a public showcase of the final prototypes.", "lecture topic": ["Review of Maxwell's equations, Boundary conditions at the interface between two media, Polarization of light-wave, TEM, TE and TM modes", "Origin of refractive index, Optical pulse propagation in a dispersive medium, Ray-optics approximation", "Transfer matrix method in ray-optics, Optical components and their transfer matrices: beam-splitter, polarizer, mirror. Optical components: Interferometers", "Laser and photodiodes", "Surface plasmon at metal-dielectric interface, LSPR, Plasmonic sensors", "Brief introduction to FDTD, numerical dispersion. ", "Lab: MIT Electromagnetic Equation Propagation (MEEP)", "Designing planar and nano-particle based plasmonic sensors in MEEP", "Molding the flow of light, Bloch's theorem, Photonic band-gap (PBG) concept", "1D, 2D and 3D photonic crystals, Lab: Introduction to MIT Photonic Bands (MPB)", "Lab: Line-defect in a 2D photonic crystal and design of on-chip optical waveguides.\nLab: Point-defect in a 2D photonic crystal and design of on-chip, high-Q optical resonators. "], "assessment plan": ""}, "RF Circuit Design 1.xlsx": {"course_desc": "Historical Aspects – From Maxwell to Current Wireless standards; The bridge between communication system designer and RF IC Designer:  a) Communication system  \ncharacterization, b)RF System Characterization ; Transceiver Architecture -- Motivation for the individual blocks;  Lumped, passive RLC, RF properties of MOS, Tuned Amplifiers; ; LNAs: Noise sources, Cascades and LNA Design; Mixers – passive and active mixers ; Oscillators: Analysis Fundamentals, Inductors, LC Oscillators and VCOs; Frequency synthesizers:Principles, Integer N vs Fractional PLL, Design Concepts   ", "lecture topic": ["Historical Aspects – From Maxwell to Current Wireless standards ", "The bridge between communication system designer and RF IC \nDesigner: Comm. System characterization, RF System characterization ", "Transceiver Architectures – Motivation for the individual blocks ", "Lumped, passive RLC, RF properties of MOS, Tuned Amplifiers ", "Low Noise Amplifiers: Noise Sourcse, Cascades, Design Example", "Mixers: Active and Passive", "Oscillators: Analysis Fundamentals and Inductors LC Oscillators and VCOs ", "Frequency Synthesizers: Principles,Design,  Integer N vs. Fractional N PLL "], "assessment plan": "A35"}, "Robotics(Minor Updates).xlsx": {"course_desc": "This course will provide a comprehensive knowledge in robotics from theory to implementation. The course will cover fundamental concepts related to mathematical modelling, path planning and control of various robotic systems including robot manipulators, ground robots and drones. We will use several software platforms like Simulink, Matlab Robotics Toolbox, ROS and Gezebo for simulations and projects. Further hardware demos will be shown using Qbot 2e (ground robot), 3dr solo (drone) and rotary inverted pendulum (robot arm) available in control lab. ", "lecture topic": ["Introduction to robotic systems (manipulator, ground robot, drone etc.), overview of robotics engineering : modelling, planning and control", "Mathematical Modelling - Coordinate transformation, rigid body representation ", "manipulators : forward kinematics, inverse kinematics, velocity kinematics", "Euler-Lagrange and Newton-Euler formulation of dynamics, quarternion representation (discussion on dynamics of quadrotors), mobile robots : nonholonomic constraints, kinematic model : unicycle and bicycle", "Path and Trajectory Planning - graph-based planning : Dijkstra and A star, configuration space, obstacles", "sampling based planning : probabilistic road map and randomly exploring rapid trees, artificial potential fields, introduction to trajectory planning", "Controls - state space representation, linearization, linear Control : pole placement and LQR , Lyapunov stability theory", "nonlinear control", "Project Presentation - Tentative topics : SLAM, Perception (Visual Servoing), Machine learning based path planning etc. "], "assessment plan": "A34"}, "Scientific Computing.xlsx": {"course_desc": "This is an overview course to be offered to 3rd and 4th year undergraduate, and postgraduate students. The course is structured to systematically build on and provide an overview of several ideas and topics that comprise the basics of discretizations of continuous mathematics. In this setup, we will concern ourselves with computational as well as stability analyses of both methods and algorithms. \n\nWe will begin with an introduction to scientific computing. Then we will analyze and study methods in numerical linear algebra: matrix factorizations, direct solution of linear systems, solutions of linear least square problems, and solutions to eigenvalue problems.\n\nThis will be followed by solutions of nonlinear equations in 1d and then more generally. We will apply this learning to unconstrained optimization in 1d and again more generally. We will also delve into some constrained optimization and nonlinear least squares problems.\n\nThe next part of the course will discuss polynomial interpolation (including using splines) of discrete data in 1d. This will be utilized in methods for numerical differentiation of sampled data, and for numerically carrying out integration in 1d (also known as quadrature).\n\nThe last part of the course will deal with numerical solutions of initial and boundary value ordinary differential equations in 1d. This will be followed by a foray into numerical solution of model partial differential equations.\n\nA student registering for the MTH573 version of the course will be required to work on an additional Pass/No Pass project for getting the course credits. Graduate students, in particular, will not be allowed to register for the 373 listing of this course.", "lecture topic": ["Introduction: computer arithmetic, round-off, error propagation, stability of algorithms; Linear systems: existence and uniqueness, sensitivity and conditioning, direct methods: Gaussian elimination and LU factorization, Cholesky for symmetric positive definite", "Overview of iterative methods for linear systems, Linear least squares, existence and uniqueness, sensitivity and conditioning, normal equations, QR factorization (Householder, Givens and Gram-Schmidt)", "Singular value decomposition, eigenvalue problems, existence and uniqueness, sensitivity and conditioning, similarity transformation, power iteration and variants, deflation, QR iteration", "Krylov subspace methods; generalized eigenvalue problems, nonlinear equations, existence and uniqueness (contraction mapping theorem), sensitivity and conditioning, bisection, fixed point iteration, Newton’s method and variations (all in 1d)", "Methods for system of nonlinear equations (Newton’s, Broyden’s); Optimization problems, existence, uniqueness, sensitivity, and conditioning; unconstrained optimization (steepest descent, Newton’s, BFGS, conjugate-gradient), nonlinear least squares (Gauss-Newton, Levenberg-Marquardt)", "Constrained optimization (sequential quadratic and linear programming); Interpolation: existence, uniqueness and conditioning; polynomial and piecewise polynomial interpolation", "Integration: existence, uniqueness and conditioning; numerical quadrature (Newton-Cotes, Gaussian, progressive and composite quadrature); numerical differentiation (finite difference and Richardson extrapolation)", "Initial value problems for ordinary differential equations (ODEs): existence, uniqueness and conditioning, Euler’s methods, accuracy and stability, stiffness, higher-order single-step methods, Runge-Kutta methods (Heun’s, RK4), multistep methods (Adams-Bashforth, Adams-Moulton); methods for systems of ODEs", "Boundary value problems for ODEs: existence, uniqueness, and conditioning; shooting method, finite differences, collocation, Galerkin’s method; overview of sparse linear solvers", "Partial differential equations: introduction and classification; time-dependent problems, finite-difference schemes for one-dimensional parabolic and hyperbolic model problems (heat, advection and wave equations)", "Consistency and stability (Lax equivalence theorem), CFL condition, von-Neumann analysis and stability condition", "Time-independent problems, boundary conditions, finite difference methods for one- and two-dimensional Poisson’s", "Linear finite element method for one- and two-dimensional Poisson’s"], "assessment plan": "A35"}, "SE with Open Source.xlsx": {"course_desc": "In this course, we will go over the basic software engineering principles and concepts. Then we will study the OSS processes and methods (along with tools for supporting them), a few common architectures to develop software (e.g. microservices), and some commonly used OS frameworks and systems. ", "lecture topic": ["Software engineering concepts - process, testing, project management", "OSS methods, processes, and tools", "Main categories of OSS, licencint", "Building application using open source processes and components", "A few different Open source frameworks, components for building applications", "Service oriented computing and microservices"], "assessment plan": "A24"}, "Security Engineering.xlsx": {"course_desc": "This course is designed to present the students a “host” centric approach to various aspects of computer software security. Broadly, the course would cover: Traditional multi-level security models (Bell La-Padula, Biba etc.), access controls, security in traditional computer programs and attacks against them (buffer/heap overflow attacks), defences against such attacks, writing secure programs (Secure Coding), Viruses/Malware and Trojans, OS level hardening, application and system level security primitives and APIs, cryptographic system primitives and APIs (how to (not) use (and break) them), system level authentication frameworks, introduction to allied topics – IDS, network security etc.", "lecture topic": ["Introductions - Basics of Computer Systems Security, thinking wrt security, traditional security models -- their applicability and their drawbacks ", "Access controls -- implementations in various OSes, usage, vulnerabilities and defenses", "Introduction to Buffer Overflow Vulnerabilities", "Stack Smashing Attack", "Stack Smashing Demo, formatted output", "Formatted output wrap-up, \nDynamic memory allocation", "Dynamic memory allocation vulnerabilities wrap-up. Mid-term review", "Return2Libc attacks,", "Crash course in applied cryptography -- history, stream ciphers, block ciphers -- DES, AES, modes of operation. Encryption using OpenSSL.", "Message authentication and integrity, Public Key Cryptography. Generating hashes and digests using OpenSSL", "Miscellaneous -- Key Derivation Function, PBKDF, Disk Encryption DH Key Exchange, Web of Trust (GPG)", "Authentication: Needham Schroeder Protocol, Kerberos, PKI", "X.509 Certificates, OpenSSL Certificates, Introduction to Linux PAM"], "assessment plan": "A35"}, "Social and Political Philosophy.xlsx": {"course_desc": "This course will introduce students to some of the fundamental debates in contemporary social and political philosophy. It will cover a range of concepts, theories, ideas, and thinkers, and their relevance in current contexts. The course will have two parts.  In the first part we will explore the philosophical debates in the Western Political Theory tradition and discuss philosophical positions on Utilitarianism, Equality, Libertarianism, Marxism, Multiculturism, and Feminism. The second part of the course will focus on debates in the Indian political theoretical tradition. This part will engage with debates on religion, freedom, and equality within the Indian context and apply it to important contemporary social and political questions. ", "lecture topic": ["Introduction to social and political philosophy- the key questions", "Utilitarianism", "Liberal Equality ", "Libertarianism", "Marxism", "Communitarianism", "Multiculturalism", "Feminism", " What is Indian political Theory (IPT)", "Debates on Equality in IPT", "Debates on Freedom in IPT", "Debates on Religion in IPT", "Revisions and Presentations"], "assessment plan": "A30"}, "Solid State Devices.xlsx": {"course_desc": "This course provides fundamental knowledge required for many other courses in Analog, digital and Mixed signal IC design (Analog CMOS Circuit Design, Mixed Signal Design, Low Power Design and Digital VLSI Design). The course starts with an overview of semiconductors and their conduction mechanism. Then explains PN junction formation and operation of various types of two terminal semiconductor devices and BJTs. The discussion will be extended to MOSCAP and MOSFETs, which are very important elements in the modern IC design. In addition MOSFET short channel effects will also be explained as they are becoming highly significant with technology scaling.  Fabrication process will also be covered. ", "lecture topic": ["Introduction to Semiconductors, Energy bands, intrinsic and extrinsic Silicon Carrier transport in Silicon: Diffusion current, drift current, mobility, Resistivity, Generations and recombination of carriers, excess carriers (6) ", "PN junction diode ideal and non-ideal characteristics \nForward bias, reverse bias, breakdown, tunneling, ohmic contacts, near ohmic contacts (6)", " Schottky diode, Light emitting diode, photo diode  BJTs: IV characteristics, small signal model, high frequency models, breakdown (6)", "MOS capacitors, MOSFET ideal and non-ideal characteristics, inversion, accumulation, threshold voltage, small signal models, triode and saturation, sub-threshold conduction  (12) ", "  Device fabrication, Short channel effects: Charge sharing, DIBL, velocity saturation, hot carriers (9)"], "assessment plan": "A27"}, "Stochastic Processes and Applications.xlsx": {"course_desc": "This is a second course in Probability Theory and Stochastic Processes. It assumes a background in elementary probability theory which will be reviewed and overviewed initially. The course then develops the necessary mathematics and intuition to understand discrete and continuous stochastic processes. Students will learn not merely results but proofs as well. This will help students firmly understand the underlying mathematics and provide the intuition for setting up a model in a specific application or a problem. These problems can be from diverse fields such as engineering, physics, operations research, economics, finance, or statistics.", "lecture topic": ["Review of probability; Bernoulli process; conditional expectations; moment generating functions; Markov and Chebyshev inequalities; central limit theorem", "Poisson process; Gaussian process; covariance matrices and properties; finite Markov chains", "Renewal theory: basics, discrete version, Blackwell and other theorems", "Continuous time Markov chains: basics, birth-death chains, reversibility, uniformizability ", "Random Walks and Martingales", "Special topics including real-world applications"], "assessment plan": "A33"}, "Theatre Appreciation.xlsx": {"course_desc": "Studying Theories propounded by Masters of Theatre and their lives and influences. The course is designed not only to give a theoretical appreciation of theatre but it will be largely interspersed with class room improvisations and voice and movement exercises so that the students have a hands-on understanding right from the start", "lecture topic": ["Introduction to Theatre, Dos and Donts", "Jerzy Grotowsky. Theoretical understanding of his Thespian life of and techniques", "Badal Sircar. Theoretical understanding of his Thespian life and techniques", "Voice exercises, practicing mime and movement, Theatre Games", "Solo Mime Performances by Students, Mid Term Mime Play Project", "Dramatic reading of a classic western play by students", "Studying concepts proposed by Constantine Stanislavsky ", "Study of Theatrical concepts like Constructivism, Socialist Realism, Pavlovian Psychology etc", "Dramatic reading of a contemporary play by a significant Indian playwrights", "Theatrical improvisations in class based on Stanislavsk’s Method Acting", "Dramatic reading of a contemporary play by a significant Indian playwrights", "End Sem Play Project. ", "Class Room Guidance for Public Performances"], "assessment plan": "A35"}, "Theories of Ethics.xlsx": {"course_desc": "The history of Ethics in the western philosophical tradition has witnessed a fundamental shift in its set of concerns and its basic approach in modernity that marks a ‘decisive break’ in relation to its point of departure in ancient Greek thought. This shift, broadly characterized, consists in moving from the question of what constitutes a ‘good life’—one that is conducive to the fullest realization of human potentiality, to what constitutes ‘right’ or ‘wrong’ action.  \n    This course will articulate and analyse the major ethical theories and approaches in the Western tradition in light of this shift. Such a broad historical perspective would allow students to apprehend why for instance, the preoccupation with the ‘Good’ gives rise to ethics of a particular ‘shape’, namely, ‘virtue ethics’; whereas the questions of ‘right’ and ‘wrong’, along with the procedural mode of their determination, emerge in the context of Enlightenment modernity, and the ‘disenchantment of nature’ that it brings in its wake. If ethics, under conditions of modernity, is compelled to take a more procedural form, as a reaction to ethical scepticism and the evisceration of ‘ethical content’ that the deracination of God from nature, hence of purposiveness in nature, entails, then the issue of what remains of the ‘old’ in the ‘new’, of the ancient in the modern, also surfaces. These themes would be pursued in different modalities, by raising, for instance, the problematic of the (privileged) ontological status of the ‘human’ (as opposed to the ‘animal’), in the modern discourse on ‘Human rights’.  \n", "lecture topic": ["Introduction: What is Metaethics? Theoretical and Historical approaches\n\n", "Introduction: Continued\n\n", "Ethical Theories: Virtue Ethics and the Natural Rights Tradition", "Virtue Ethics, Continued", "Ethical Theories: Consequentialist Theories: Utilitarianism", "Utilitarianism, Continued", "Utilitarianism, Continued", "Deontological Ethics: The Kantian tradition ", "Deontological Ethics: Kant Continued", "Deontological Ethics: Rawls and the 'Veil of Ignorance' ", "Deontological Ethics: Amartya Sen's critique of Rawls and theories of justice in the 'transcendental style'  ", "Peter Singer on animal rights", "Further issues in contemporary ethics"], "assessment plan": "A30"}, "Topics in Adaptive Security.xlsx": {"course_desc": "This course focuses on providing students an interactive discussion based learning platform for exploration of topics in adaptive cyber security. The learning will be through instruction, course project and more importantly through discussions on student(s) presentation of assigned research papers. The instruction part of the course will cover basic contents required to understand the course materials, including topics such as threat intelligence, situational awareness and real-time adaptive security. Through this course, students can learn the state of the art and open problems in adaptive cyber security, thus enhancing their potential to perform research or pursue a career in this emerging area.", "lecture topic": ["Refresher of basic concepts in Information Security and Machine Learning required for adaptive cybersecurity\nIntroduction to Adaptive Cybersecurity", "Dynamic Vulnerability Assessment", "Advanced Topics in Moving Target Defense ", "Advanced Topics in Dynamic Intrusion Detection and Prevention", "Dynamic Threat Assessment/Intelligence with Predictive Analytics ", "Proactive Cybersecurity using User Behavioral Modeling ", "Buffer for additional topics++++++++++"], "assessment plan": "A29"}, "Topics in Number Theory.xlsx": {"course_desc": "The aim of this course is to introduce various topics in Number Theory such as Farey fractions, continued fractions,  partitions,  quadratic forms and geometry of numbers.", "lecture topic": ["Farey Fractions and Irrational Numbers: Farey sequences, Rational approximations, Irrational Numbers, Hurwitz’s Theorem. ", "Continued Fractions: Finite continued fractions, convergents to a continued fraction, continued fractions with positive quotients, simple continued fractions, the representation of an irreducible rational fraction by a simple continued fraction, the continued fraction algorithm and Euclid’s algorithm, the difference between the fraction and its convergents, Infinite simple continued fractions, the representation of an irrational number by an infinite continued fraction, periodic continued fractions, representation of quadratic surds by continued fractions, Approximation by convergents, Hurwitz’s Theorem, Pell’s Equation.", "Partitions: Partitions of Numbers, Generating functions, Geometric representations, Two theorems of Euler and further algebraic identities, Jacobi’s triple product identity and its special cases, congruence properties of p(n), The Rogers-Ramanujan identities, Ramanujan’s continued fraction.", "Quadratic forms: Positive quadratic forms, Equivalence of quadratic forms, Hermite’s Theorem, Sums of squares.", "Geometry of Numbers: Blichfeldtz’s Principle, Minkowski’s Convex Body Theorem and its applications."], "assessment plan": "A32"}, "Urban Space and Political Power.xlsx": {"course_desc": "This course will enable students to evaluate urban governance practices. It draws on the ideas of 'space' and 'political power' to develop insights into the nature of urban governance and politics. With this main objective in mind, the course is broadly divided in two parts: the first part engages with the concepts of ‘space’, ‘political power’ and ‘urban governance’. The second part, introduces urban processes and events from the urban conglomeration of Delhi to empirically populate and exemplify  the concepts discussed in the first half of the course. By the end of the course, the students will be able to develop an understanding of the ideas of 'space' and 'political power', and the distinctiveness of urban governance, especially in Delhi.    \n", "lecture topic": ["Introduction: Urban Governance and Politics", "What is Political Power? Power and Authority ", "Geographies of Power and Resistence \n", "The Distinctiveness of Urban Space\n", "Understanding Urban Governance\n", "Planning and Governing the Urban Space: The Case of Delhi\n\n", "How Urban Governance Actually Works? Everyday Politics in Delhi\n\n", "Urban Space and the Digital Re-Configuration  \n", "Political Power in the Digital Age: E-Governance ", "Political Power and the Digital: Smart Cities \n\n", "Urban Spaces and the Forms of Political Contestations\n\n", "Space, Political Power and Urban Governance: A Reassessment ", "Revisions"], "assessment plan": "A30"}, "Visual-Design-and-Communication.xlsx": {"course_desc": "VISUAL DESIGN \nBased on the premise that Visual Design is a discipline of design that applies the principles of visual language for better analysis and understanding of design problem and solution, this course focuses on the elements and principles of the visual language and their semantic use. A multi-disciplinary domain, design consists of, aesthetics, architecture, products, communication, processes, systems, technology, business/commerce, ramification on environment and society and demands clear understanding of design fundamentals. Apart from the thorough knowledge of core concepts, design also requires the representation of concepts visually to make effective or functional communication and iteration of ideas. For creative skills and aesthetic sense, one must clearly understand the use of basic design elements and their applications for a particular design solution. \nFor a designer to communicate more concisely and in a visually appropriate manner, it is necessary to use commonly understood principles, perspective and design layout standards. Together, these conventions constitute a visual language, and help to ensure that the drawing is clear and relatively easy to understand. \n\nVISUAL COMMUNICATION\nThe concept and science of Visual Communication is introduced as the relationship between human information processing, with emphasis on processing of visual information and design of messages. It includes visual perception, Gestalt laws of organization, semantics, working memory (STM & LTM) and their implications on.\nThe course also introduces students to the fundamentals of Typography and Photography. The Typography course introduces students to the fundamentals of Typography and its application in effective product interface/communication. And the Photography course introduces the students to photography as a medium of visual language and applies it to visual design. In today’s world that is crowded with visual stimulus it is important to cut through the noise and be able to decipher, capture and create visual images that communicate.\n", "lecture topic": ["1. INTRODUCTION TO VISUAL DESIGN\nThe importance of understanding visual language and its relation in context to nature and environment\n2. ELEMENTS OF VISUAL LANGUAGE\nExploring and understanding Dots, Lines, Forms, Space, Pattern, Texture and Colour as an elements of visual language.\n", "3. INTRODUCTION TO THE PRINCIPLES OF VISUAL LANGUAGE\nVisual explorations and experiments with Form, Colour, and Space, Texture, in relation to the context and environments – Concepts of harmony, balance, contrast, proportion, order, symmetry, asymmetry, rhythm,tension, juxtaposition, proximity, size, scale, proportion, orientation, alignment, variety, gradation, dominance, subordination, transition etc.\n", "4. INTRODUCTION TO FUNDAMENTALS OF TYPOGRAPHY\n Introduces Typography as a means of Communication and engages in typographical explorations to understand the technicalities, nuances and aesthetics of types.\n\n", "5. INTRODUCTION TO FUNDAMENTALS OF TYPOGRAPHY Contd\nStudy of visual principles of text and image composition : \nLayouts, Grids, Content Development and Information Hierarchy.\nApplication of Typography, Image and layouts in the design of signage systems, identity systems, social communications, ", "6. INTRODUCTION TO PHOTOGRAPHY\nStudy of photography as a medium to document, communicate and create photographic imagery.\n", "7. PHOTOGRAPHY CONT'D\nExploring photo story as a narrative medium.", "8. INTRODUCTION TO VIDEOGRAPY\nStudy of videography as a medium to document, communicate and create a short 2 minute video.", "9. COMMUNICATION THEORIES, SEMIOTICS  AND VISUAL PERCEPTION\nUnderstand the process of communication and the theories that make a difference to the development of a visual language.", "10. STORY TELLING, NARRATIVES AND ITS ROLE IN DESIGN\nUnderstand story telling and narratives as effective methods to scope problems and problem solving processes.", "11. FINAL PROJECT", "11. FINAL PROJECT", "11. FINAL PROJECT", "11. FINAL PROJECT"], "assessment plan": ""}}